run_2D/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.6 0.1)
    ( 1.2 -0.6 0.1)
    ( 1.2  0.6 0.1)
    (-0.5  0.6 0.1)
    (-0.5 -0.6 0.125)
    ( 1.2 -0.6 0.125)
    ( 1.2  0.6 0.125)
    (-0.5  0.6 0.125)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (68 48 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    TOP
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    BOTTOM
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    INLET
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    OUTLET
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    SYMMETRY
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    WALL
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
