run_2D/template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (5.06094 1.07574 0.0 );

boundaryField
{
   "(INLET|BOTTOM)"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(OUTLET|TOP)"
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    Wing.stl
    {
        type            noSlip;
    }

    SYMMETRY
    {
        type            empty;
    }

    WALL
    {
        type            empty;
    }

}


// ************************************************************************* //
