run_2D/template/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(OUTLET|TOP)"
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    Wing.stl
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    SYMMETRY
    {
        type            empty;
    }

    WALL
    {
        type            empty;
    }

}


// ************************************************************************* //
