run_2D/template/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            fixedValue;
        value           uniform 10;
    }

    "(OUTLET|TOP)"
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }

    Wing.stl
    {
        type            omegaWallFunction;
        value           uniform 10;
    }

    SYMMETRY
    {
        type empty;
    }

    WALL
    {
        type empty;
    }
}


// ************************************************************************* //
