run_2D/template/system/force
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible (pressure is kinematic, e.g. m^2/s^2).
\*---------------------------------------------------------------------------*/

type              forces;
libs              ("libforces.so");
log               yes;
patches           ( Wing.stl );
rho               rhoInf;
rhoInf            1.225;
CofR              (0 0 0);
pitchAxis         (0 0 1);

// ************************************************************************* //