run_2D/template/system/surfaceData
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the surface integral of one or more fields on a patch.
\*---------------------------------------------------------------------------*/

type                surfaceRegion;
libs                ("libfieldFunctionObjects.so");
log                 yes;
writeFields         true;
surfaceFormat       raw;
regionType          patch;
name                Wing.stl;
operation           none;
fields              ( p U );

// ************************************************************************* //